{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v4.13.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of73.bin", "group1-shard2of73.bin", "group1-shard3of73.bin", "group1-shard4of73.bin", "group1-shard5of73.bin", "group1-shard6of73.bin", "group1-shard7of73.bin", "group1-shard8of73.bin", "group1-shard9of73.bin", "group1-shard10of73.bin", "group1-shard11of73.bin", "group1-shard12of73.bin", "group1-shard13of73.bin", "group1-shard14of73.bin", "group1-shard15of73.bin", "group1-shard16of73.bin", "group1-shard17of73.bin", "group1-shard18of73.bin", "group1-shard19of73.bin", "group1-shard20of73.bin", "group1-shard21of73.bin", "group1-shard22of73.bin", "group1-shard23of73.bin", "group1-shard24of73.bin", "group1-shard25of73.bin", "group1-shard26of73.bin", "group1-shard27of73.bin", "group1-shard28of73.bin", "group1-shard29of73.bin", "group1-shard30of73.bin", "group1-shard31of73.bin", "group1-shard32of73.bin", "group1-shard33of73.bin", "group1-shard34of73.bin", "group1-shard35of73.bin", "group1-shard36of73.bin", "group1-shard37of73.bin", "group1-shard38of73.bin", "group1-shard39of73.bin", "group1-shard40of73.bin", "group1-shard41of73.bin", "group1-shard42of73.bin", "group1-shard43of73.bin", "group1-shard44of73.bin", "group1-shard45of73.bin", "group1-shard46of73.bin", "group1-shard47of73.bin", "group1-shard48of73.bin", "group1-shard49of73.bin", "group1-shard50of73.bin", "group1-shard51of73.bin", "group1-shard52of73.bin", "group1-shard53of73.bin", "group1-shard54of73.bin", "group1-shard55of73.bin", "group1-shard56of73.bin", "group1-shard57of73.bin", "group1-shard58of73.bin", "group1-shard59of73.bin", "group1-shard60of73.bin", "group1-shard61of73.bin", "group1-shard62of73.bin", "group1-shard63of73.bin", "group1-shard64of73.bin", "group1-shard65of73.bin", "group1-shard66of73.bin", "group1-shard67of73.bin", "group1-shard68of73.bin", "group1-shard69of73.bin", "group1-shard70of73.bin", "group1-shard71of73.bin", "group1-shard72of73.bin", "group1-shard73of73.bin"], "weights": [{"name": "model.shared/model.shared/embeddings", "shape": [61950, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/embed_positions/embeddings", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.0/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.1/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.2/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.3/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.4/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/encoder/layers.5/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/embed_positions/embeddings", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.0/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.1/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.2/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.3/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.4/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/self_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/k_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/k_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/q_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/q_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/v_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/v_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/out_proj/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn/out_proj/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/encoder_attn_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/fc1/kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/fc1/bias", "shape": [2048], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/fc2/kernel", "shape": [2048, 512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/fc2/bias", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/final_layer_norm/gamma", "shape": [512], "dtype": "float32"}, {"name": "tf_marian_mt_model/model/decoder/layers.5/final_layer_norm/beta", "shape": [512], "dtype": "float32"}, {"name": "final_logits_bias", "shape": [1, 61950], "dtype": "float32"}]}]}